<template>
  <div id="OutputsTable">
    <table border="3" style="border-collapse: collapse; border-color:black">
      <thead>
        <tr bgcolor="orange">
          <td>アウトプット</td>
        </tr>
      </thead>
      <tr>
        <td>・プロジェクト憲章</td>
      </tr>
      <tr>
        <td>
          ・プロジェクトマネジメント計画書
          <p>・スコープマネジメント計画書</p>
          <p>・要求事項マネジメント計画書</p>
          <p>・スケジュールマネジメント計画書</p>
          <p>・コストマネジメント計画書</p>
          <p>・品質マネジメント計画書</p>
          <p>・資源マネジメント計画書</p>
          <p>・コミュニケーションマネジメント計画書</p>
          <p>・調達マネジメント計画書</p>
          <p>・ステークホルダーエンゲージメント計画書</p>
          <p>・変更マネジメント計画書</p>
          <p>・コンフィギュレーションマネジメント計画書</p>
        </td>
      </tr>
      <tr>
        <td>
          ・プロジェクト文書
          <p>・アクティビティ属性</p>
          <p>・アクティビティリスト</p>
          <p>・前提条件ログ</p>
          <p>・見積りの根拠</p>
          <p>・変更ログ</p>
          <p>・コスト見積り</p>
          <p>・コスト予測</p>
          <p>・所要期間見積り</p>
          <p>・課題ログ</p>
          <p>・教訓登録簿</p>
          <p>・マイルストーンリスト</p>
          <p>・物的資源の割当て</p>
          <p>・プロジェクトカレンダー</p>
          <p>・プロジェクト伝達事項</p>
          <p>・プロジェクトスケジュール</p>
          <p>・プロジェクトスケジュールネットワーク図</p>
          <p>・プロジェクトスコープ記述書</p>
          <p>・プロジェクトチームの任命</p>
          <p>・品質コントロール測定結果</p>
          <p>・品質尺度</p>
          <p>・品質報告書</p>
          <p>・要求事項文書</p>
          <p>・要求事項トレーサビリティマトリックス</p>
          <p>・資源ブレークダウンストラクチャー</p>
          <p>・資源カレンダー</p>
          <p>・資源要求事項</p>
          <p>・リスク登録簿</p>
          <p>・リスク報告書</p>
          <p>・スケジュールデータ</p>
          <p>・スケジュール予測</p>
          <p>・ステークホルダー登録簿</p>
          <p>・チーム憲章</p>
          <p>・テスト及び評価文書</p>
          <p>・ビジネス・ケース</p>
          <p>・ベネフィットマネジメント計画書</p>
          <p>・合意書</p>
          <p>・組織体の環境要因</p>
          <p>・組織のプロセス資産</p>
          <p>・成果物</p>
          <p>・作業パフォーマンス測定結果</p>
          <p>・作業パフォーマンス情報</p>
          <p>・作業パフォーマンス報告書</p>
          <p>・変更要求</p>
          <p>・承認済み変更要求</p>
          <p>・受け入れ済み成果物</p>
          <p>・検証済み成果物</p>
          <p>・調達文書</p>
          <p>・プロジェクト資金要求事項</p>
          <p>・チームのパフォーマンス評価</p>
          <p>・調達戦略</p>
          <p>・入札文書</p>
          <p>・調達作業範囲記述書</p>
          <p>・発注先選定基準</p>
          <p>・内外製決定</p>
          <p>・独自コスト見積り</p>
          <p>・納入候補のプロポーザル</p>
          <p>・選定済み納入者</p>
          <p>・終結済み調達</p>
        </td>
      </tr>
      <tr>
        <td>
          ・ベースライン
          <p>・スコープベースライン</p>
          <p>・スケジュールベースライン</p>
          <p>・コストベースライン</p>
          <p>・パフォーマンス測定ベースライン</p>
        </td>
      </tr>
      <tr>
        <td>・プロジェクトライフサイクルの記述</td>
      </tr>
      <tr>
        <td>・開発アプローチ</td>
      </tr>
    </table>
  </div>
</template>

<script>
export default {
  name: "OutputsTable",
  props: {
    msg: String
  }
};
</script>

<style scoped>
a {
  text-decoration: none;
}
p {
  text-indent: 1.5em;
  margin: 0;
  padding: 0 0 0 10px;
}
table {
  width: 400px;
}
.processes {
  padding: 0 0 0 30px;
}

#OutputsTable {
  float: left;
  padding: 0 0 0 30px;
}
thead > tr > td {
  text-align: center;
}
td {
  text-align: left;
}
</style>

